In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [7]:
df_cust = pd.read_csv(r'C:\Users\charan.lalwani\Documents\cf\Achievement 4\Instacart basket analysis\02 Data\Original Data\customers.csv', index_col = False)

In [8]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Renaming the columns

In [9]:
df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [10]:
df_cust.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [11]:
df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [12]:
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [13]:
df_cust.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [14]:
df_cust.rename(columns = {'n_dependants' : 'no.of dependants'}, inplace = True)

In [15]:
#Changing the data type
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [19]:
df_test = pd.DataFrame()

In [21]:
for col in df_test.columns.tolist():
  weird = (df__test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

# missing values

In [22]:
df_cust.isnull().sum()

user_id                 0
first_name          11259
surname                 0
Gender                  0
state                   0
age                     0
date_joined             0
no.of dependants        0
marital_status          0
income                  0
dtype: int64

# duplicates

In [24]:
df_dups = df_cust[df_cust.duplicated()]

In [25]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, surname, Gender, state, age, date_joined, no.of dependants, marital_status, income]
Index: []

# No action required for missing values and no duplicates were found.

In [27]:
df_ords_prods_merged = pd.read_pickle(r'C:\Users\charan.lalwani\Documents\cf\Achievement 4\Instacart basket analysis\02 Data\Prepared data\ords_prods_merged.pkl')

In [28]:
df_ords_prods_merged.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,merge_indicator,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,spenders,Spending_Flag,median_days_since_prior_order,order_frequency_flag
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,both,Regularly busy,Regularly busy,Most orders,10,New customer,10,High spender,20.5,Regular customer
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,both,Regularly busy,Slowest days,Fewest orders,10,New customer,10,High spender,20.5,Regular customer
2,473747,1,prior,3,3,12,21.0,196,1,1,...,both,Regularly busy,Slowest days,Most orders,10,New customer,10,High spender,20.5,Regular customer
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,both,Least busy,Slowest days,Fewest orders,10,New customer,10,High spender,20.5,Regular customer
4,431534,1,prior,5,4,15,28.0,196,1,1,...,both,Least busy,Slowest days,Most orders,10,New customer,10,High spender,20.5,Regular customer

In [32]:
#Changing the data type
df_ords_prods_merged['user_id'] = df_ords_prods_merged['user_id'].astype('str')

In [37]:
df_merged = pd.merge(df_cust, df_ords_prods_merged, on='user_id', indicator='merge_flag')

# Exporting dataframe

In [38]:
path = r"C:\Users\charan.lalwani\Documents\cf\Achievement 4\Instacart basket analysis\02 Data\Prepared data"

In [39]:
df_merged.to_pickle(os.path.join(path, 'customer_prods_ords_merged.pkl'))